Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
bool legacyValid(const LegacyConfig &c) {
  return c.magic == CONFIG_MAGIC && (c.version == 1 || c.version == 2) &&
         c.threshold >= 0 && c.threshold <= 4095 &&
         c.restAngle >= 0 && c.restAngle <= 180 && c.pressAngle >= 0 && c.pressAngle <= 180 &&
         c.holdMs >= 1 && c.holdMs <= 2000 && c.airMs >= 1 && c.airMs <= 3000 &&
         c.travelMs >= 1 && c.travelMs <= 10000 && c.sampleMs >= 1 && c.sampleMs <= 1000;
}

void migrateLegacy(const LegacyConfig &old) {
  config = Config{};
  config.threshold = old.threshold;
  config.restAngle = old.restAngle;
  config.pressAngle = old.pressAngle;
  config.holdMs = old.holdMs;
  config.airMs = old.airMs;
  config.actuatorMs = old.actuatorMs;
  config.travelMs = old.travelMs;
  config.minTravelMs = old.minTravelMs;
  config.landingMs = old.landingMs;
  config.clearanceMs = old.clearanceMs;
  config.gapMs = old.gapMs;
  config.cooldownMs = old.cooldownMs;
  config.rearmMs = old.rearmMs;
  config.themeFlipMs = old.themeFlipMs;
  config.sampleMs = old.sampleMs;
  config.adapt = old.adapt;
  config.adaptStepPct = old.adaptStepPct;
  config.theme = old.theme;
  config.debug = old.debug;
  if (old.version == 1) {
    if (config.sampleMs == 2) config.sampleMs = 5;
    if (config.gapMs == 120) config.gapMs = 40;
    if (config.landingMs == 30) config.landingMs = 50;
    if (config.clearanceMs == 90) config.clearanceMs = 100;
    if (config.adaptStepPct == 6.0f) config.adaptStepPct = 3.0f;
  }
}

bool saveConfig(bool announce = true) {
  if (!prefsReady) return false;
  Config copy = getConfig();
  bool ok = prefs.putBytes("config", &copy, sizeof(copy)) == sizeof(copy);
  if (announce) Serial.println(ok ? "[SAVE] Saved to flash." : "[SAVE] Flash write failed.");
  return ok;
}

void loadConfig() {
  prefsReady = prefs.begin("dino", false);
  if (!prefsReady) {
    Serial.println("[NVS] Flash unavailable; using defaults.");
    return;
  }
  size_t bytes = prefs.getBytesLength("config");
  bool migrated = false;
  if (bytes == sizeof(Config)) {
    prefs.getBytes("config", &config, sizeof(config));
  } else if (bytes == sizeof(LegacyConfig)) {
    LegacyConfig old{};
    prefs.getBytes("config", &old, sizeof(old));
    if (legacyValid(old)) { migrateLegacy(old); migrated = true; }
  }
  if (!configValid(config)) {
    config = Config{};
    Serial.println("[NVS] Defaults loaded.");
  } else if (migrated) {
    Serial.println("[NVS] Existing calibration migrated.");
  } else {
    Serial.println("[NVS] Saved configuration loaded.");
  }
  prefs.putBytes("config", &config, sizeof(config));
  sensorRatio = prefs.getFloat("ratio", DEFAULT_SENSOR_RATIO);
  if (sensorRatio < 0.5f || sensorRatio > 6.0f) sensorRatio = DEFAULT_SENSOR_RATIO;
}

int readSensor() { return analogRead(SENSOR_PIN); }

int median3(int a, int b, int c) {
  if (a > b) { int t = a; a = b; b = t; }
  if (b > c) { int t = b; b = c; c = t; }
  if (a > b) b = a;
  return b;
}

bool classifyWhite(int adc, int threshold, bool previous) {
  return previous ? adc > threshold - SENSOR_HYSTERESIS
                  : adc > threshold + SENSOR_HYSTERESIS;
}

void resetEnvelopeLocked() {
  detector.active = false;
  detector.startMs = 0;
  detector.lastObstacleMs = 0;
  detector.oppositeSinceMs = 0;
}

void resetRoundLocked() {
  detector = Detector{};
  detector.travelMs = config.travelMs;
  detector.gapMs = config.gapMs;
}

void updateRoundTimingLocked(uint64_t now) {
  float scale = 1.0f;
  if (config.adapt && detector.roundStarted && now > detector.roundStartMs) {
    float elapsedS = static_cast<float>(now - detector.roundStartMs) / 1000.0f;
    float speed = ROUND_START_SPEED + ROUND_ACCEL_PER_SECOND * elapsedS;
    if (speed > ROUND_MAX_SPEED) speed = ROUND_MAX_SPEED;
    scale = speed / ROUND_START_SPEED;
  }
  detector.speedScale = scale;
  uint32_t travel = static_cast<uint32_t>(config.travelMs / scale + 0.5f);
  if (travel < config.minTravelMs) travel = config.minTravelMs;
  detector.travelMs = travel;
  uint32_t gap = static_cast<uint32_t>(config.gapMs / scale + 0.5f);
  uint32_t minGap = config.sampleMs * 3;
  detector.gapMs = gap > minGap ? gap : minGap;
}

void startRoundLocked(uint64_t firstCactusExitMs) {
  if (detector.roundStarted) return;
  detector.roundStarted = true;
  detector.roundStartMs = firstCactusExitMs;
  updateRoundTimingLocked(firstCactusExitMs);
}

uint32_t roundElapsedMsLocked(uint64_t now) {
  if (!detector.roundStarted || now <= detector.roundStartMs) return 0;
  uint64_t elapsed = now - detector.roundStartMs;
  return elapsed > UINT32_MAX ? UINT32_MAX : static_cast<uint32_t>(elapsed);
}

void pushWidthPulseLocked(uint32_t pulseMs) {
  detector.widthHistory[detector.widthIndex] = pulseMs;
  detector.widthIndex = (detector.widthIndex + 1) % WIDTH_HISTORY_SIZE;
  if (detector.widthCount < WIDTH_HISTORY_SIZE) ++detector.widthCount;
}

uint32_t widthReferenceLocked() {
  if (!detector.widthCount) return 0;
  uint32_t values[WIDTH_HISTORY_SIZE];
  for (size_t i = 0; i < detector.widthCount; ++i) values[i] = detector.widthHistory[i];
  for (size_t i = 1; i < detector.widthCount; ++i) {
    uint32_t v = values[i];
    size_t j = i;
    while (j && values[j - 1] > v) { values[j] = values[j - 1]; --j; }
    values[j] = v;
  }
  size_t index = detector.widthCount >= 3 ? 2 : detector.widthCount - 1;
  return values[index];
}

float estimateWidthLocked(uint32_t pulseMs, uint32_t referenceMs) {
  if (!referenceMs || detector.widthCount < CLASSIFY_WARMUP) return 1.0f;
  float cactusMs = referenceMs / (sensorRatio + 1.0f);
  float sensorMs = referenceMs - cactusMs;
  if (cactusMs < 1.0f) return 1.0f;
  float widths = (pulseMs - sensorMs) / cactusMs;
  return widths < 0.5f ? 0.5f : widths;
}

void clearClickQueue() {
  ClickCommand ignored{};
  while (clickQueue && xQueueReceive(clickQueue, &ignored, 0) == pdTRUE) {}
}

bool queueClick(uint64_t atMs, bool manual, uint32_t holdMs, const Config &cfg) {
  ClickCommand cmd{atMs, playGeneration, cfg.pressAngle, cfg.restAngle, holdMs, manual, cfg.debug};
  if (xQueueSend(clickQueue, &cmd, 0) == pdTRUE) return true;
  queueLog("[WARN] Servo queue full; click dropped.");
  return false;
}

bool queueClick(uint64_t atMs, bool manual, bool longJump = false) {
  Config cfg = getConfig();
  return queueClick(atMs, manual, longJump ? cfg.longHoldMs : cfg.holdMs, cfg);
}

