Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
void insertPending(ClickCommand *pending, size_t &count, const ClickCommand &cmd) {
  if (count >= CLICK_QUEUE_SIZE) return;
  size_t i = count;
  while (i && pending[i - 1].atMs > cmd.atMs) {
    pending[i] = pending[i - 1];
    --i;
  }
  pending[i] = cmd;
  ++count;
}

void prunePending(ClickCommand *pending, size_t &count) {
  size_t out = 0;
  for (size_t i = 0; i < count; ++i) {
    if (pending[i].manual || (playing && pending[i].generation == playGeneration))
      pending[out++] = pending[i];
  }
  count = out;
}

void servoTask(void *) {
  ClickCommand pending[CLICK_QUEUE_SIZE]{};
  size_t count = 0;
  for (;;) {
    prunePending(pending, count);
    TickType_t wait = portMAX_DELAY;
    if (count) {
      uint64_t now = nowMs();
      uint64_t ms = pending[0].atMs > now ? pending[0].atMs - now : 0;
      wait = ms ? pdMS_TO_TICKS(static_cast<uint32_t>(ms)) : 0;
    }
    ClickCommand incoming{};
    if (xQueueReceive(clickQueue, &incoming, wait) == pdTRUE) {
      insertPending(pending, count, incoming);
      continue;
    }
    if (!count) continue;
    ClickCommand cmd = pending[0];
    for (size_t i = 1; i < count; ++i) pending[i - 1] = pending[i];
    --count;
    if (!cmd.manual && (!playing || cmd.generation != playGeneration)) continue;
    uint64_t actual = nowMs();
    servo.write(cmd.pressAngle);
    TickType_t hold = pdMS_TO_TICKS(cmd.holdMs);
    vTaskDelay(hold ? hold : 1);
    servo.write(cmd.restAngle);
    if (cmd.debug) {
      uint64_t late = actual > cmd.atMs ? actual - cmd.atMs : 0;
      queueLog("[CLICK] hold=%lu task-late=%llu ms",
               static_cast<unsigned long>(cmd.holdMs),
               static_cast<unsigned long long>(late));
    }
  }
}

void finalizeEnvelopeLocked(uint64_t now) {
  if (!detector.active || detector.lastObstacleMs < detector.startMs) {
    resetEnvelopeLocked();
    return;
  }
  uint32_t pulseMs = static_cast<uint32_t>(detector.lastObstacleMs - detector.startMs);
  if (!pulseMs) pulseMs = 1;
  startRoundLocked(detector.lastObstacleMs);
  updateRoundTimingLocked(now);
  pushWidthPulseLocked(pulseMs);
  uint32_t referenceMs = widthReferenceLocked();
  float widthEstimate = estimateWidthLocked(pulseMs, referenceMs);
  bool longJump = detector.widthCount < CLASSIFY_WARMUP || widthEstimate >= config.longAtWidths;
  float sensorFootprintMs = referenceMs
      ? referenceMs * sensorRatio / (sensorRatio + 1.0f)
      : pulseMs * sensorRatio / (sensorRatio + 1.0f);
  int64_t edgeCorrection = static_cast<int64_t>(sensorFootprintMs * 0.5f);
  uint32_t holdMs = longJump ? config.longHoldMs : config.holdMs;
  uint32_t airMs = longJump ? config.longAirMs : config.airMs;
  int64_t entry = static_cast<int64_t>(detector.startMs) + edgeCorrection + detector.travelMs;
  int64_t exit = static_cast<int64_t>(detector.lastObstacleMs) - edgeCorrection + detector.travelMs;
  if (exit < entry) exit = entry;
  int64_t exitContact = exit + config.landingMs - airMs;
  int64_t safeContact = entry - config.clearanceMs;
  int64_t commandAt = (exitContact < safeContact ? exitContact : safeContact) - config.actuatorMs;
  bool entrySafety = safeContact < exitContact;
  bool delayedLanding = false;
  bool delayedCooldown = false;
  if (detector.hasPlan) {
    int64_t afterLanding = static_cast<int64_t>(detector.lastLandingMs) + config.rearmMs - config.actuatorMs;
    int64_t afterCooldown = static_cast<int64_t>(detector.lastCommandMs) + config.cooldownMs;
    if (commandAt < afterLanding) { commandAt = afterLanding; delayedLanding = true; }
    if (commandAt < afterCooldown) { commandAt = afterCooldown; delayedCooldown = true; }
  }
  uint64_t lateMs = 0;
  if (commandAt < static_cast<int64_t>(now)) {
    lateMs = static_cast<uint64_t>(static_cast<int64_t>(now) - commandAt);
    commandAt = static_cast<int64_t>(now);
  }
  const char *reason = lateMs ? "sensor-too-close" :
                       delayedLanding ? "post-landing-rejump" :
                       delayedCooldown ? "cooldown" :
                       entrySafety ? "entry-safety" : "exit-aligned";
  uint64_t executeAt = static_cast<uint64_t>(commandAt);
  if (queueClick(executeAt, false, holdMs, config)) {
    ++detector.plannedJumps;
    detector.lastCommandMs = executeAt;
    detector.lastLandingMs = executeAt + config.actuatorMs + airMs;
    detector.hasPlan = true;
    uint32_t roundMs = roundElapsedMsLocked(now);
    queueLog("[PLAN] #%lu %s width=%.2f round=%.1fs speed=x%.2f travel=%lu gap=%lu hold=%lu cmd-in=%lld late=%llu %s",
             static_cast<unsigned long>(detector.plannedJumps),
             longJump ? "LONG" : "SHORT", widthEstimate,
             roundMs / 1000.0f, detector.speedScale,
             static_cast<unsigned long>(detector.travelMs),
             static_cast<unsigned long>(detector.gapMs),
             static_cast<unsigned long>(holdMs),
             static_cast<long long>(static_cast<int64_t>(executeAt) - static_cast<int64_t>(now)),
             static_cast<unsigned long long>(lateMs), reason);
  }
  resetEnvelopeLocked();
}

void sensorTask(void *) {
  TickType_t wake = xTaskGetTickCount();
  int first = readSensor();
  int samples[3] = {first, first, first};
  size_t sampleIndex = 0;
  filteredWhite = first > config.threshold;
  for (;;) {
    Config cfg = getConfig();
    vTaskDelayUntil(&wake, pdMS_TO_TICKS(cfg.sampleMs));
    samples[sampleIndex] = readSensor();
    sampleIndex = (sampleIndex + 1) % 3;
    int adc = median3(samples[0], samples[1], samples[2]);
    uint64_t now = nowMs();
    bool themeChanged = false;
    bool newBackground = false;
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    lastSensorValue = adc;
    filteredWhite = classifyWhite(adc, config.threshold, filteredWhite);
    updateRoundTimingLocked(now);
    if (playing) {
      bool obstacle = filteredWhite != backgroundIsWhite;
      if (config.theme == ThemeMode::Auto) {
        if (obstacle) {
          if (!detector.oppositeSinceMs) detector.oppositeSinceMs = now;
          if (now - detector.oppositeSinceMs >= config.themeFlipMs) {
            backgroundIsWhite = filteredWhite;
            newBackground = backgroundIsWhite;
            resetEnvelopeLocked();
            obstacle = false;
            themeChanged = true;
          }
        } else {
          detector.oppositeSinceMs = 0;
        }
      }
      if (obstacle) {
        if (!detector.active) { detector.active = true; detector.startMs = now; }
        detector.lastObstacleMs = now;
      } else if (detector.active && now - detector.lastObstacleMs >= detector.gapMs) {
        finalizeEnvelopeLocked(now);
      }
    }
    xSemaphoreGive(stateMutex);
    if (themeChanged) queueLog("[THEME] Background rebased to %s.", colorName(newBackground));
  }
}

void chooseBackground() {
  int adc = readSensor();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  lastSensorValue = adc;
  filteredWhite = adc > config.threshold;
  backgroundIsWhite = config.theme == ThemeMode::Light ? true :
                      config.theme == ThemeMode::Dark ? false : filteredWhite;
  xSemaphoreGive(stateMutex);
}

void printManual() {
  Serial.println("\nstart | arm | stop | click | longclick | show | sensor | reset | defaults");
  Serial.println("theme auto|light|dark");
  Serial.println("<name> <value>  (auto-saved)");
  Serial.println("threshold rest press hold longhold air longair longat");
  Serial.println("actuator travel mintravel landing clearance gap sample cooldown rearm");
  Serial.println("ratio adapt debug");
  Serial.println("Round clock: first cactus after boot/reset = t0; adapt on = timed acceleration\n");
}

