Selmi-Med-Dhia/Dino_Game_Auto_Player_ESP32/src/main.cpp
void printStatus() {
  Config cfg = getConfig();
  int adc = readSensor();
  uint64_t now = nowMs();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  float ratio = sensorRatio;
  float speed = detector.speedScale;
  uint32_t effectiveTravel = detector.travelMs;
  uint32_t effectiveGap = detector.gapMs;
  bool bg = backgroundIsWhite;
  bool roundStarted = detector.roundStarted;
  uint32_t roundMs = roundElapsedMsLocked(now);
  uint32_t ref = widthReferenceLocked();
  xSemaphoreGive(stateMutex);
  Serial.println("\n=== Dino Auto-Player ===");
  Serial.printf("Run=%s | round=%s", playing ? "ON" : "OFF",
                roundStarted ? "RUNNING" : "WAITING FOR FIRST CACTUS");
  if (roundStarted) Serial.printf(" (%.1f s)", roundMs / 1000.0f);
  Serial.println();
  Serial.printf("Sensor=%d (%s) | threshold=%d | background=%s | theme=%s\n",
                adc, colorName(adc > cfg.threshold), cfg.threshold, colorName(bg), themeName(cfg.theme));
  Serial.printf("Servo: rest=%d press=%d | SHORT hold=%lu air=%lu | LONG hold=%lu air=%lu\n",
                cfg.restAngle, cfg.pressAngle,
                static_cast<unsigned long>(cfg.holdMs), static_cast<unsigned long>(cfg.airMs),
                static_cast<unsigned long>(cfg.longHoldMs), static_cast<unsigned long>(cfg.longAirMs));
  Serial.printf("Long jump: width >= %.2f cactus-widths | pulse reference=%lu ms\n",
                cfg.longAtWidths, static_cast<unsigned long>(ref));
  Serial.printf("Acceleration: speed=x%.2f | timed=%s | 6.0 -> 13.0 at +0.060/s\n",
                speed, onOff(cfg.adapt));
  Serial.printf("Timing: travel=%lu->%lu gap=%lu->%lu actuator=%lu landing=%lu clearance=%lu\n",
                static_cast<unsigned long>(cfg.travelMs), static_cast<unsigned long>(effectiveTravel),
                static_cast<unsigned long>(cfg.gapMs), static_cast<unsigned long>(effectiveGap),
                static_cast<unsigned long>(cfg.actuatorMs), static_cast<unsigned long>(cfg.landingMs),
                static_cast<unsigned long>(cfg.clearanceMs));
  Serial.printf("Sensor: sample=%lu ratio=%.2f:1 hysteresis=%d | debug=%s | flash=%s\n",
                static_cast<unsigned long>(cfg.sampleMs), ratio, SENSOR_HYSTERESIS,
                onOff(cfg.debug), prefsReady ? "ready" : "unavailable");
}

void armFreshRound(bool clickToStart) {
  chooseBackground();
  uint64_t now = nowMs();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  ++playGeneration;
  resetRoundLocked();
  playing = true;
  bool bg = backgroundIsWhite;
  int adc = lastSensorValue;
  xSemaphoreGive(stateMutex);
  clearClickQueue();
  Serial.printf("[ARM] Ready. Round clock will start when the next cactus passes. Background=%s sensor=%d.\n",
                colorName(bg), adc);
  if (clickToStart && queueClick(now, true, false)) Serial.println("[START] Initial short click queued.");
}

void stopAutoplay() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  playing = false;
  ++playGeneration;
  resetEnvelopeLocked();
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);
  clearClickQueue();
  servo.write(rest);
  Serial.println("[STOP] Autoplay stopped.");
}

enum class SetResult { Changed, Invalid, Unknown };

SetResult setParameter(String rawName, String value) {
  String name = normalize(rawName);
  long number = 0;
  if (name == "ratio") {
    float ratio;
    if (!parseFloatValue(value, ratio) || ratio < 0.5f || ratio > 6.0f) return SetResult::Invalid;
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    sensorRatio = ratio;
    xSemaphoreGive(stateMutex);
    if (prefsReady) prefs.putFloat("ratio", ratio);
    Serial.printf("[SET] ratio = %.2f\n", ratio);
    return SetResult::Changed;
  }
  bool changed = false, resetRound = false, refreshBackground = false, moveRest = false;
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  if (name == "threshold" || name == "rest" || name == "press" || name == "clickangle") {
    if (!parseLong(value, number)) { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
    if (name == "threshold" && number >= 0 && number <= 4095) config.threshold = number;
    else if (name == "rest" && number >= 0 && number <= 180) config.restAngle = number;
    else if ((name == "press" || name == "clickangle") && number >= 0 && number <= 180)
      config.pressAngle = number;
    else { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
    changed = true;
    refreshBackground = name == "threshold";
    moveRest = name == "rest" && !playing;
  } else if (name == "adapt" || name == "debug" || name == "autotheme") {
    bool flag;
    if (!parseBool(value, flag)) { xSemaphoreGive(stateMutex); return SetResult::Invalid; }
    if (name == "adapt") { config.adapt = flag; resetRound = true; }
    else if (name == "debug") config.debug = flag;
    else {
      config.theme = flag ? ThemeMode::Auto :
                     (backgroundIsWhite ? ThemeMode::Light : ThemeMode::Dark);
      refreshBackground = true;
    }
    changed = true;
  } else if (name == "longat") {
    float width;
    if (!parseFloatValue(value, width) || width < 1.1f || width > 4.0f) {
      xSemaphoreGive(stateMutex); return SetResult::Invalid;
    }
    config.longAtWidths = width;
    changed = true;
  } else if (name == "adaptstep") {
    float f;
    if (!parseFloatValue(value, f) || f <= 0 || f > 20) {
      xSemaphoreGive(stateMutex); return SetResult::Invalid;
    }
    config.adaptStepPct = f;
    changed = true;
  } else {
    for (const auto &s : UINT_SETTINGS) {
      if (name != s.name && name != s.legacy) continue;
      if (!parseLong(value, number) || number < 0 ||
          static_cast<uint32_t>(number) < s.minValue ||
          static_cast<uint32_t>(number) > s.maxValue) {
        xSemaphoreGive(stateMutex); return SetResult::Invalid;
      }
      config.*(s.field) = static_cast<uint32_t>(number);
      changed = true;
      resetRound = name == "travel" || name == "travelms" ||
                   name == "mintravel" || name == "mintravelms" ||
                   name == "gap" || name == "gapms";
      break;
    }
  }
  if (resetRound) resetRoundLocked();
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);
  if (!changed) return SetResult::Unknown;
  if (moveRest) servo.write(rest);
  if (refreshBackground) chooseBackground();
  saveConfig();
  Serial.printf("[SET] %s = %s\n", rawName.c_str(), value.c_str());
  return SetResult::Changed;
}

bool setTheme(String value) {
  value = normalize(value);
  ThemeMode mode;
  if (value == "auto") mode = ThemeMode::Auto;
  else if (value == "light") mode = ThemeMode::Light;
  else if (value == "dark") mode = ThemeMode::Dark;
  else return false;
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  config.theme = mode;
  resetEnvelopeLocked();
  xSemaphoreGive(stateMutex);
  chooseBackground();
  saveConfig();
  Serial.printf("[THEME] %s.\n", themeName(mode));
  return true;
}

void restoreDefaults() {
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  config = Config{};
  sensorRatio = DEFAULT_SENSOR_RATIO;
  resetRoundLocked();
  bool moveRest = !playing;
  int rest = config.restAngle;
  xSemaphoreGive(stateMutex);
  if (moveRest) servo.write(rest);
  chooseBackground();
  saveConfig();
  if (prefsReady) prefs.putFloat("ratio", DEFAULT_SENSOR_RATIO);
  Serial.println("[DEFAULTS] Defaults restored and saved.");
}

void handleCommand(String line) {
  line.trim();
  line.toLowerCase();
  if (!line.length()) return;
  if (line.startsWith("set ")) { line.remove(0, 4); line.trim(); }
  int split = line.indexOf(' ');
  String command = split < 0 ? line : line.substring(0, split);
  String value = split < 0 ? "" : line.substring(split + 1);
  value.trim();
  if (command == "help" || command == "manual" || command == "?") {}
  else if (command == "start" || command == "run") armFreshRound(true);
  else if (command == "arm") armFreshRound(false);
  else if (command == "stop" || command == "pause") stopAutoplay();
  else if (command == "click" || command == "jump") {
    if (queueClick(nowMs(), true, false)) Serial.println("[MANUAL] Short click queued.");
  } else if (command == "longclick" || command == "longjump") {
    if (queueClick(nowMs(), true, true)) Serial.println("[MANUAL] Long click queued.");
  } else if (command == "show" || command == "status") printStatus();
  else if (command == "sensor") {
    Config cfg = getConfig();
    int adc = readSensor();
    Serial.printf("[SENSOR] ADC=%d -> %s (threshold=%d)\n",
                  adc, colorName(adc > cfg.threshold), cfg.threshold);
  } else if (command == "reset") {
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    ++playGeneration;
    resetRoundLocked();
    playing = true;
    xSemaphoreGive(stateMutex);
    clearClickQueue();
    Serial.println("[RESET] Round reset. Autoplay remains armed; the next cactus becomes t=0.");
  } else if (command == "defaults") restoreDefaults();
  else if (command == "theme") {
    if (!setTheme(value)) Serial.println("[ERR] Use: theme auto | theme light | theme dark");
  } else if (value.length()) {
    SetResult r = setParameter(command, value);
    if (r == SetResult::Invalid) Serial.println("[ERR] Invalid value.");
    else if (r == SetResult::Unknown) Serial.println("[ERR] Unknown setting.");
  } else Serial.println("[ERR] Unknown command.");
}

void serialTask(void *) {
  for (;;) {
    LogMessage message{};
    while (xQueueReceive(logQueue, &message, 0) == pdTRUE) Serial.println(message.text);
    while (Serial.available()) {
      char c = static_cast<char>(Serial.read());
      if (c == '\n' || c == '\r') {
        if (serialLine.length()) {
          handleCommand(serialLine);
          serialLine = "";
          printManual();
        }
      } else if (serialLine.length() < 120) serialLine += c;
    }
    vTaskDelay(pdMS_TO_TICKS(10));
  }
}

void fatal(const char *message) {
  Serial.println(message);
  for (;;) vTaskDelay(pdMS_TO_TICKS(1000));
}

}  // namespace

void setup() {
  Serial.begin(115200);
  delay(200);
  pinMode(SENSOR_PIN, INPUT);
  analogReadResolution(12);
  stateMutex = xSemaphoreCreateMutex();
  if (!stateMutex) fatal("[FATAL] Could not create state mutex.");
  loadConfig();
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  resetRoundLocked();
  playing = true;
  ++playGeneration;
  xSemaphoreGive(stateMutex);
  servo.setPeriodHertz(50);
  servo.attach(SERVO_PIN, 500, 2400);
  servo.write(config.restAngle);
  clickQueue = xQueueCreate(CLICK_QUEUE_SIZE, sizeof(ClickCommand));
  logQueue = xQueueCreate(LOG_QUEUE_SIZE, sizeof(LogMessage));
  if (!clickQueue || !logQueue) fatal("[FATAL] Could not create runtime queues.");
  chooseBackground();
  if (xTaskCreatePinnedToCore(servoTask, "dino-servo", 4096, nullptr, 5,
                              &servoTaskHandle, 1) != pdPASS ||
      xTaskCreatePinnedToCore(sensorTask, "dino-sensor", 4096, nullptr, 4,
                              &sensorTaskHandle, 0) != pdPASS ||
      xTaskCreatePinnedToCore(serialTask, "dino-serial", 4096, nullptr, 2,
                              &serialTaskHandle, 0) != pdPASS) {
    fatal("[FATAL] Could not create FreeRTOS tasks.");
  }
  Serial.println("\nDino ESP32 Auto-Player ready (auto-armed + timed acceleration).");
  Serial.println("[AUTO] Waiting for the first cactus; its trailing edge becomes round t=0.");
  Serial.println("Runtime: sensor task + servo task + serial task. loop() stays idle.");
  printStatus();
  printManual();
}

void loop() {
  vTaskDelay(portMAX_DELAY);
}
